export const state = () => ({
  sidebar: false,
  lessons: [
    {
      title_sans: 'श्रुतबोधः',
      title_eng: 'Introduction to Shrutabodha',
      id: 1,
      definition_sans: '<p>श्रुतमात्रेण प्रस्तारादिविनैव छंदसामार्यानुत्पुवादीनां लक्षणं गुरुलघुवर्णमात्रागणादिस्वरूपं बुध्यते ज्ञायते । </p>',
      definition_eng: '<p></p>'
    },
    {
      title_sans: 'गुरुलघुलक्षणम्',
      title_eng: 'Identifying a Guru and a Laghu',
      id: 2,
      definition_sans: 'संयुक्ताद्यं दीर्घं सानुस्वारं विसर्गसंमिश्रम् ।<br>विज्ञेयमक्षरं गुरु पदांतस्थं विकल्पेन ।।<p>अथ छंदोलक्षणस्य लघुगुरुज्ञानमंतरेण दुर्विज्ञेयत्वाल्लघुगुरुलक्षणमाह। </p><p>एतादृशमक्षरं गुरु ज्ञेयम् –</p><ul><li>संयुक्तस्य संयोगीभूतस्याद्यमादिभवम्।</li><li>दीर्घं द्विमात्रकम् । </li><li>अनुस्वारेण सह वर्तमानम् ।</li><li> विसर्ग सहितम् ।</li><li> पादान्तस्थमक्षरं विकल्पेन गुरु लघु विज्ञेयम् ।</li><li> पादान्ते गुरुरपि लघुः स्यात्कुत्राचिल्लघुरपि गुरुः स्यात् । वा पादान्ते त्वसौ वक्रो ज्ञेयोऽन्यो मात्रको लघुः</li></ul>',
      definition_eng: '<ul><li>Vowel or consonant followed by anusvāra - aṃ, kaṃ, khaṃ, gaṃ, etc  </li><li>Vowel or consonant followed by Visarga - aḥ, kaḥ, etc </li><li>The vowels ā, ī, ū, etc… are long. Whenever any of these is used in a verse separately or with one or more consonants, it will be considered as long. Eg: kā, kī, etc are long syllables </li><li>A conjunct consonant – ṣṇa, kta, etc</li><li>At the end of a quarter a short syllable can be considered as long.</li></ul>',
      example_sans: ''
    },
    {
      title_sans: 'अष्टगणानां लक्षणम्',
      title_eng: 'Characteristics of Eight Gaṇas',
      id: 3,
      definition_sans: 'आदिमध्यावसानेषु भजसायांति गौरवम् ।<br> यरता लाघवं यांति मनौ तु गुरुलाघवम् ॥<br><br><p>भजसाः भगणजगणसगणाः आदिमध्यावसानेषु गौरवं गुरुतां यान्ति । आदिश्च मध्यं च आवसानं च तानि तेषु ।</p><p>आदिगुरुर्भगणः मध्यगुरुर्जगणः अन्त्यगुरुः सगणः </p><p>यरताः यगणरगणतगणाः आदिमध्यावसानेषु लाघवं लघुतां यान्ति। आदिलघुर्यगणः मध्यलघू रगणः अन्त्यलघुस्तगणः। </p>मनौ मगणनगणौ आदिमध्यावसानेषु गुरुलाघवं गुरुतां लघुतां च यातः। सर्वगुरुर्मगणः सर्वलघुर्नगणः भवतीति। </p>',
      definition_eng: ''
    },
    {
      title_sans: 'आर्या',
      title_eng: 'āryā',
      id: 4,
      definition_sans: 'यस्याः पादे प्रथमे द्वादश मात्रास्तथा तृतीयेऽपि। <br>अष्टादश द्वितीये चयुर्थके पंचदश सार्या॥ <br><br><p>यस्याः प्रथमे पादे द्वादश मात्राः स्युः। तृतीये तथा द्वादश मात्रा भवन्ति। द्वितीयेऽष्टादश मात्रा भवन्ति । चतुर्थके पञ्चदश मात्रा भवन्ति । सा आर्या । चरणेषु क्रमान्पात्राः:- १२,१८,१२,१५ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'गीतिः',
      title_eng: 'Gīti',
      id: 5,
      definition_sans: 'आर्यापूर्वार्धसमं द्वितीयमपि यत्र भवति हंसगते।<br>छंदोविदस्तदानीं गीतिं ताममृतवाणि भाषंते॥<br><br>पूर्वार्धस्य प्रथमे द्वादश मात्रा द्वितीयेऽष्टादश तृतीये द्वादश चतुर्थकेऽष्टादश संकलनया षष्टिमात्रेत्यर्थः। अमृतमिव वाणी वाक् यस्याः सामृतवाणी तस्याः संबुद्धौ। छन्दांसि वदन्ति जानन्तीति छन्दोविदः शास्त्रज्ञा इत्यर्थः। हंसस्य गतिर्गमनमिव गमनं यस्याः सा हंसगता तस्याः संबुद्धौ हंसगते इत्यर्थः । चरणेषु क्रमान्मात्राः – १२,१८,१२,१८॥',
      definition_eng: ''
    },
    {
      title_sans: 'उपगीतिः',
      title_eng: 'Upagīti',
      id: '6',
      definition_sans: 'आर्योत्तरार्धतुल्यं प्रथमार्धमपि प्रयुक्तं चेत् ।<br> कामिनि तामुपगीतिं प्रकाशयंते महाकवयः॥<br><br><p>उपगीति - यदि आर्योत्तरार्धतुल्यं प्रथमार्धमपि प्रयुक्तं चेत्प्रयोगीकृतं भवति। उत्तरार्धेन द्वादशमात्रिकेण तुल्यं समानं भवति। प्रथमे द्वादश मात्रा द्वितीये पञ्चदश तृतीये द्वादश चतुर्थे पञ्चदश संकलनया ५४ चतुष्पञ्चाशन्मात्रेत्यर्थः। कामो विद्यते यस्याः सा कामिनी तस्याः संबुद्धौ। महांतश्च ते कवयश्चेति कर्मधारयः। चरणेषु क्रमान्मात्राः – १२,१५,१२,१५॥',
      definition_eng: '',
      common: ''
    },
    {
      title_sans: 'पङ्क्तिः',
      title_eng: 'Pankti',
      id: '7',
      definition_sans: 'आद्यचतुर्थं पञ्चमकं चेत्। <br> यत्र गुरु स्यात्साक्षरपङ्क्तिः॥७॥<br><br><p>यस्यां वृत्तौ आद्यं प्रथमं चतुर्थं पञ्चमकं गुरु स्यात्साक्षरपङ्क्तिः ज्ञेया । अक्षरशब्दः पादपूरणार्थः। छन्दस्तु पङ्क्तिः । प्रतिचरणे इदं लक्षणम् । चरणाक्षराणि ५, ग० भ; गु, गु॥</p>',
      definition_eng: '',
      common: ''
    },
    {
      title_sans: 'शशिवदना',
      title_eng: 'śaśivadanā',
      id: 8,
      definition_sans: 'अगुरुचतुष्कं भवति गुरु द्वौ। <br> घनकुचयुग्मे शशिवदनासौ॥ <br><br><p>यत्राद्यं चत्वारो वर्णा लघवं सन्ति ततो द्वौ पञ्चमषष्ठौ गुरू दीर्घौ भवतस्तदा शशिवदना चरणचतुष्टयेष्विदं लक्षणं असाविति संबन्धः। घनं कठिनं कुचयुग्मं यस्याः सा घनकुचयुग्मा तस्याः संबुद्धौ। ॥८॥ चरणाक्षराणि ० ६, ग० न, य॥',
      definition_eng: ''
    },
    {
      title_sans: 'मदलेखा',
      title_eng: 'Madalekhā',
      id: 9,
      definition_sans: 'तुर्यं पंचमकं चेद्यत्र स्याल्लघु बाले। <br> विद्वद्भिर्मृगनेत्रे प्रोक्ता सा मादलेखा॥ <br><br>यदि चतुर्थं पञ्चमं लघु स्यात् हे बाले नवयौवने विद्वद्भिः पण्डितैः सा मदलेखा प्रोक्ता। मृगस्य नेत्रे इव नेत्रे यस्याः सा मृगनेत्रा तस्याः संबुद्धौ। चरणाक्षरं ० ७, गं म, स; ग॥',
      definition_eng: '',
      common: ''
    },
    {
      title_sans: 'पद्यम्',
      title_eng: 'Padyam',
      id: 10,
      definition_sans: 'श्लोके षष्ठं गुरु ज्ञेयं सर्वत्र लेघु पञ्चमम्। <br> द्विचतुष्पादयोर्ह्रस्वं सप्तमं दीर्घमन्ययोः॥ <br><br><p> अन्ययोः प्रथमतृतीयपादयोः सप्तममक्षरं गुरु द्विमात्रकं भवति। सर्वत्र चतुर्ष्वपि चरणेषु पञ्चममक्षरं लघु स्यात्। षष्टं गुरु स्यात्। द्विचतुष्पादयोर्द्वितीयचतुर्थचरणयोः सप्तममक्षरं ह्रस्वं ज्ञेयम्। ईदृग्विधे श्लोके पद्येऽनुष्टुबादयो भवन्ति । </p><p>अथ पद्यलक्षणमाह-</p>पञ्चमं लघु सर्वत्र सप्तमं द्विचतुर्थयोः। <br> षष्ठण् गुरु विजानीयादेतत्पद्यस्य लक्षणम् ॥ <br><br> यत्र सर्वत्र चरणेषु पञ्चमं लघु भवति। द्वितीयचतुर्थचरणयोः सप्तममक्षरं लघु भवति। सर्वत्र चरणेषु षष्ठं अक्षरं गुरु भवति। चरणाक्षरं ८, गणनियमो नास्ति । ',
      definition_eng: '',
      common: ''
    },
    {
      title_sans: 'माणवकं / माणवकाक्रीडम्',
      title_eng: 'Māṇavakam',
      id: 11,
      definition_sans: 'आदिगतं तुर्यगतं पञ्चमकं चान्त्यगतम् । <br>स्याद्गुरु चेत्तत्कथितं माणवकाक्रीडमिदम् ॥<br><br>आदिगतं प्रथमं तुर्यगतं चतुर्थं पञ्चमकं पञ्चमम् अन्त्यगतं अन्त्यस्थितमष्टमं गुरु स्यात्तदिदं माणवकाक्रीडं बुधा वदन्ति।<br><br>चरणाक्ष० ८, ग० भ, त; ल, ग॥',
      definition_eng: ''
    },
    {
      title_sans: 'नगस्वरूपिणी (प्रमाणिका) ',
      title_eng: 'Nāgasvarupiṇi (Pramāṇikā)',
      id: 12,
      definition_sans: 'द्वितुर्यषष्ठमष्टमं गुरु प्रयोजितं यदा । <br> तदा निवेदयन्ति तां बुधा नगस्वरूपिणीम्॥<p>यदा द्वितीयं चतुर्थं षष्ठम् अष्टमं चाक्षरं गुरुसंज्ञकं भवति एतादृशीं तां नगस्वरूपिणीं निवेदयन्ति। ॥ प्रमाणिका, नगस्वरूपिणीति वा। च० अ० ८,ग० ज, र; ल, ग॥',
      definition_eng: '',
      common: ''
    },
    {
      title_sans: 'विद्युन्माला',
      title_eng: 'Vidyunmālā',
      id: 13,
      definition_sans: 'सर्वे वर्णा दीर्घा यस्यां विश्रामः स्याद्वेदैर्वेदैः।<br>विद्वद्दृंदैर्वीणावाणि व्याख्याता सा विद्युन्माला ॥<br><br><p>वीणायां वाणीव वाणी यस्याः सा वीणावाणी तस्याः संबुद्धौ। विदुषां पण्डितानां वृन्दानि समूहास्तैः। यस्यां सर्वे वर्णाः दीर्घाः गुरुभूताः भवन्ति। चतुर्भिश्चतुर्भिर्विश्रामो भवतीति सा विद्युन्माला। च० अ० ८, ग० म, म; ग, ग; यतिः ४, ४॥',
      definition_eng: ''
    },
    {
      title_sans: 'चंपकमाला',
      title_eng: 'Campakamālā',
      id: 14,
      definition_sans: 'तन्वि गुरु स्यादाद्यचतुर्थं पञ्चमष्ठं चान्त्यमुपान्त्यम्। <br> इन्द्रियबाणैर्यत्र विरामः सा कथनीया चंपकमाला ॥<br><br>यस्याम् आद्यचतुर्थं प्रथमं चतुर्थं पञ्चमषष्ठम् अन्त्यं दशमं नवमम् एते गुरवि भवन्ति। यत्र पञ्चभिः पञ्चभिरक्षरैर्विरामो विश्रामः। सा चंपकमाला कथनीया। आद्यचतुर्थं पञ्चमषष्ठं इत्येकत्वे द्विगुद्वन्द्वौ। इन्द्रियाणि च वाणाश्च इन्द्रियबाणास्तैः। च० अ० १०, ग० भ, म, स; ग; ५,५॥',
      definition_eng: ''
    },
    {
      title_sans: 'मणिबंधम्',
      title_eng: 'Maṇibandha',
      id: 15,
      definition_sans: 'चंपकमाला यत्र भवेदंत्यविहीना प्रेमनिधे।<br>छंदसि दक्षा ये कवयस्तन्मणिबंधं ते ब्रुवते॥<br>यत्रांत्यविहीना चंपकमाला भवेत्। दशाक्षरा इदं नवाक्षरं भवेत्। लक्षणं तु तदेव चंपकमालागतमेव तन्मणिबंधम्। प्रेमस्य निधिरिव निधिः तस्याः संबुद्धौ। अंत्यविहीनः अंते भर्वोऽसो वर्णः तेन विहीना त्यक्ता भवेत्। ॥१६॥ मणिबंधम्। च० अ० ९,ग० भ, म, स; यतिः ५, ४॥',
      definition_eng: ''
    },
    {
      title_sans: 'शालिनी',
      title_eng: 'śālinī',
      id: 16,
      definition_sans: '<p>ह्रस्वो वर्णो जायते यत्र षष्ठः कंबुग्रीवे  तद्वदेवाष्टमांत्यः।<br>विश्रामः स्यात्तन्वि वेदैस्तुरंगैस्तां भाषंते शालिनीं छांदसीयाः ॥</p><p>यस्यां षष्ठो वर्णो ह्रस्वः तद्वदष्टमांत्यः नवमः ह्रस्वो जायते, यत्र चतुर्भिः सप्तभिर्विश्रामस्तां शालिनीं भाषंते ब्रुवते। कंबोः शंखस्य ग्रीवावद्ग्रीवा यस्याः सा तत्संबुद्धौ। ॥ शालिनी । चर० अ० ११, ग० म, त, त; ग, ग; यतिः ४, ७ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'मंदाक्रांता',
      title_eng: 'Mandākrāntā',
      id: 17,
      definition_sans: '<p>चत्वारः प्राक्सुतनु गुरवो द्वादशैकादशौ चेत्<br>मुग्धे वर्णौ तदनु कुमुदामोदिनि द्वादशांत्यौ ।<br>तद्वच्चांत्यौ युगरसहयैर्यत्र कांते विरामो<br>मंदाक्रांतां प्रवरतकवयस्तन्वि तां संगिरंते॥</p><p>हे सुतनु सुष्ठु तनुः कायो यस्याः सा तस्याः संबोधनं हे सुतनु। प्रवरकवयः श्रेष्ठकवयः तां मंदाक्रांतां वदंति। यस्यां चत्वारो वर्णा गुरवो भवंति।  पुनः द्वादशैकादशौ वर्णौ गुरू भवतः। पुनः तदनु द्वादशांत्यौ त्रयोदशचतुर्दशौ वर्णौ भवतः। च पुनः अंत्यौ तद्वद्भवतः।</p><p>हे कांते च पुनः चतुःषट् सप्तभिः क्रमेण विरामो भवति प्रवरकवयस्तद्विदः॥मंदाक्रांता। च० अ० १७, गं म, भ, न, त, त; ग, ग; यतिः ४, ६, ७॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'हंसी ',
      title_eng: 'Hamsī',
      id: 18,
      definition_sans: '<p>मंदाक्रांतांत्ययतिरहिता सालंकारे भवति यदि सा।<br>तद्विद्वद्भिर्ध्रुवमभिहिताज्ञेया हंसी कमलवदने ॥</p><p>कमलवत्सौंदर्यं सौरभादिगुणैः कमलसदृशं वदनं मुखं यस्याः सा तत्संबोधनम्। यदि मंदाक्रांता अंत्ययतिरहिता अंते भवा अंत्या मंदाक्रांतायां विश्रामः सांत्यरहिता दशवर्णात्मिका सा हंसी ज्ञेया। लक्षणं मंदाक्रांताया एव। आभूषणेन सह वर्तमाना सालंकारा तस्याः संबोधनं हे सालंकारे॥१९॥ हंसी । च० अ० १०, ग० म, भ, न; ग; यतिः ४, ६॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'दोधकवृत्तम् ',
      title_eng: 'Dodhakavṛttam',
      id: 19,
      definition_sans: '<p>आद्यचतुर्थमहीननितंबे सप्तमकं दशमं च तथांत्यम्।<br>यत्र गुरु प्रकटस्मरसारे तत्कथितं ननु दोधकवृत्तम् ॥</p><p>प्रकटः स्मरसारः कामबलं यस्याः सा तस्याः संबोधनम्। हे अहीननितंबे स्थूलौ कटिपश्चाद्भागौ यस्याः सा तत्संबुद्धौ। यस्मिन् प्रथमं चतुर्थं सप्तमं दशमं तथा अंत्यं एकादशं एतानि अक्षराणि गुरूणि संति। ॥ दोधकं। च० अ० ११, ग० भ, भ, भ; ग, ग॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'इंद्रवज्रा ',
      title_eng: 'Indravajrā',
      id: 20,
      definition_sans: '<p>यस्यां त्रिषट् सप्तममक्षरं स्या-<br>ह्रस्वं सुजंघे नवमं च तद्वत्।<br>गत्या विलज्जीकृतहंसकांते<br>तामिंद्रवज्रां ब्रुवते कवींद्राः॥</p><p>गत्या गमनेन विलज्जीकृता हंसस्य कांतिः शोभा यया सा तस्याः संबोधनम्। यस्यां त्रिषट् सप्तममक्षरं ह्रस्वं स्यात् तद्वन्नवमं ह्रस्वं स्यात्। हे सुजंघे तामिति संबंधः। एतादृशीं इंद्रवज्रां ब्रुवते। सुष्ठु शोभने जंघे यस्याः सा तत्संबुद्धौ। कवीनां कविषु वा इंद्राः पूज्या बृहस्पत्यादयः। ॥ इंद्रवज्रा। च० अ० ११, ग० त, त, ज; ग, ग; यतिः ५, ६॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'उपेंद्रवज्रा ',
      title_eng: 'Upendravajrā',
      id: 21,
      definition_sans: '<p>यदींद्रवज्राचरणेषु पूर्वे<br>भवंति वर्णा लघवः सुवर्णे।<br>अमंदमाद्यन्मदने तदानीम्<br>उपेंद्रवज्रा कथिता कवींद्रैः॥</p><p>यदींद्रवज्राचरणेषु पूर्वे वर्णा लघवः संति शेषामिंद्रवज्रावत् आद्यवर्णं ह्रस्वमेवेति शेषः। चतुर्ष्वपि पादेषु आद्यो ह्रस्वः। हे सुवर्णे सा उपेंद्रवज्रा कथिता। अमंदं बहुलं माद्यन् हर्षं कुर्वन्मदनो यस्यां सा तत्संबुद्धौ। तथा चोक्तं रत्नाकरे। उपेंद्रवज्रा जतजास्ततो गौ॥ उपेंद्रवज्रा। च० अ० ११, ग० ज, त, ज; ग, ग; यतिः ५, ६॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'उपजातिः ',
      title_eng: 'Upajāti ',
      id: 22,
      definition_sans: '<p>यत्र द्वयोरप्यनयोस्तु पांदा<br>भवंति सीमंतिनि चंद्रकांते।<br>विद्वद्भिराद्यैः परिकीर्तिता सा<br>प्रयुज्यतामित्युपजातिरेषा॥</p><p>यत्र  द्वयोरनयोरिंद्रवज्रोपेंद्रवज्रयोरपि पादाः यथाक्रमेण भवंति। प्रथमे तृतीये च इंद्रवज्रालक्षणं द्वितीये चतुर्थे च उपेंद्रवज्रालक्षणम्। </p><p>चंद्रवत्कांतिर्यस्याः सा तत्संबुद्धौ पक्षे चंद्रवत्कांता कमनीया या सा तत्संबुद्धौ। ॥ उपजातिः। च० अ० ११, प्रथमे तृतीये च चरणे इंद्रवज्रा द्वितीये चतुर्थं चोपेंद्रवज्रेत्यर्थः॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'आख्यानकी ',
      title_eng: 'ākhyānaki ',
      id: 23,
      definition_sans: '<p>आख्यानकी स्यात्प्रकटि<br>यदींद्रवज्राचरणः पुरस्ता<br>उपेंद्रवज्राचरणास्त्रयोऽन्ये<br>मनीषिणोक्ता विपरीतपूर्वा ॥</p><p>यदि इंद्रवज्रावत्प्रथमचरणः स्यात् अन्ये त्रयश्चरण उपेंद्रवज्रावत्संति तदा विपरीतपूर्वाख्यानकी विपरीताख्यानकीत्यर्थः। प्रकटीकृतोऽर्थः कामलक्षणो यया सा तत्संबुद्धौ इयं वृत्तरत्नाकरे नोक्ता तथापि गलादिभिराचार्यैर्हलायुधादावुक्तैव ॥आख्यानकी। च० अ० ११, प्रथमचरण इंद्रवज्रावत् अन्ये उपेंद्रवज्रावत् </p>',
      definition_eng: ''
    },
    {
      title_sans: 'रथोद्धता ',
      title_eng: 'Rathodhatā',
      id: 24,
      definition_sans: '<p>आद्यमक्षरमतस्तृतीयकं<br>सप्तमं च नवमं तथांतिमम्।<br>दीर्घमिंदुमुखि यत्र जायते<br>तां वदंति कवयो रथोद्धताम्॥</p><p>यत्राद्यमक्षरमतस्तृतीयकं सप्तमं नवमं तथांतिमं एकादशं एते वर्णा दीर्घा द्विमात्रका जायंते। इंदुवन्मुखं यस्याः सा तत्संबुद्धौ। रथोद्धता। च० अ० ११, ग० र, न, र; ल, ग; यतिः ७, ४ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'स्वागता ',
      title_eng: 'Svāgatā',
      id: 25,
      definition_sans: '<p>अक्षरं च नवमं दशमं चेत्<br>व्यत्ययाद्भवति यत्र विनीते।<br>प्रोक्तमेणनयने यदि सैव<br>स्वागतेति कविभिः कथितासौ ॥</p><p>एणस्य नयने इव नयने यस्याः सा तस्याः संबुद्धौ। अयमर्थः। रथोद्धतायां नवमं अक्षरं गुरु भवति दशमं चाक्षरं लघु भवति स्वागतायां तु नवममक्षरं लघु दशमं चाक्षरं गुरु भवति । स्वागता। च० अ० ११, ग० र, न, भ, ग, ग; यतिः ७, ४॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'वैश्वदेवी ',
      title_eng: 'Vaiśvadevī',
      id: 26,
      definition_sans: '<p>ह्रस्वो वर्णः स्यात्सप्तमो यत्र बाले<br>तद्वद्दिंबोष्ठि न्यस्य एकादशाद्यः।<br>बाणैर्विश्रामस्तत्र चेद्वा तुरंगै-<br>र्नाम्ना निर्दिष्टा सुभ्रु सा वैश्वादेवी॥</p><p>यत्र सप्तमो वर्णो ह्रस्वः स्यात्। दशमि वर्णो ह्रस्वः स्यात्। एवं न्यस्तः निक्षिप्तः स्याच्चेद्यदि तत्र पंचभिः सप्तभिश्च विश्रामः स्यात्। हे सुभ्रु सा नाम्ना वैश्वदेवी निर्दिष्टा कथिता। ॥ वैश्वदेवी । च० अ० १२, ग० म, म,य, य; यतिः ५, ७॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'तोटकम्  ',
      title_eng: 'Totakam',
      id: 27,
      definition_sans: '<p>सतृतीयकषष्ठमनंतरते<br>नवमं विरतिप्रभवं गुरु चेत्।<br>घनपीनपयोधरभारनते<br>ननु तोटकवृत्तमिदं कथितम्॥</p><p>तृतीयकं षष्ठं नवमं गुरु स्यात्तृतीयं षष्ठं च तृतीयषष्ठे ताभ्यां सह वर्तत इति। कीदृशं विरतिप्रभवं अंत्यं द्वादशं गुरु स्यात्। अनंता अपरिमिता रतिर्यस्याः सा अनंतरता तत्संबुद्धौ। ॥ तोटकम् । च० अ० १२, ग० स, स, स, स; यतिः ६, ६॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'भुजंगप्रयातम्  ',
      title_eng: 'Bhujangaprāyatam',
      id: 28,
      definition_sans: '<p>यदाद्यं चतुर्थं तथा सप्तमं चे-<br>त्तथैवाक्षरं ह्रस्वमेकादशाद्यम्।<br>शरच्चंद्रविद्वेषिक्रारविंदे<br>तदुक्तं कवींद्रैर्भुजंगप्रयातम् ॥</p><p>आद्यं प्रथमं तथा चतुर्थं तथा सप्तमं एव निश्चितं एकादशाद्यं एकादशस्यादि भूतं दशममक्षरं ह्रस्वं स्यादिति संबंधः। शरदः चंद्रः शरच्चंद्रः तस्य विद्वेषि वक्रमेवारविंदं यस्याः सा तत्संबुद्धौ। ॥ भुजंगप्रयातम् । च० अ०१२, ग० य, य, य, य; यतिः ६, ६॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'द्रुतविलंबितम् ',
      title_eng: 'Drutavilambitā',
      id: 29,
      definition_sans: '<p>अयि कृशोदरि यत्र चतुर्थकं<br>गुरु च सप्तमकं दशमं तथा।<br>विरतिजं च तथैव विचक्षणै-<br>र्द्रुतविलंबितमित्युपदिश्यते ॥</p><p>हे कृशोदरि यत्र चतुर्थकं चेत्सप्तमकं तथा दशमं इमान्यक्षराणि गुरूणि सन्ति। विरतिजं अंत्यं द्वादशं गुरू स्यादित्यर्थः । कृशमुदरं यस्याः सा कृशोदरी तत्संबुद्धौ। द्रुतविलंबितम्। च० अ० १२, ग० न, भ, भ, र ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'प्रतिमाक्षरा',
      title_eng: 'Pramitākṣarā',
      id: 30,
      definition_sans: '<p>यदि तोटकस्य गुरू पंचमकं<br>विहितं विलासिनि तदक्षरकम् ।<br>रससंख्यकं गुरू न चेदबले<br>प्रमिताक्षरेति कविभिः कथिता ॥</p><p>यदि तोटकस्य उक्तलक्षणकस्य पंचमकं वर्णं गुरू विहितं स्यात् । षष्ठं गुरू न चेत् गुरू तु पंचममेव । सा प्रमिताक्षरेत्यर्थः । विलासो विभ्रमो यस्याः सा विलासिनी तत्संबुद्धौ । प्रमिताक्षरा । च०अ० १३, ग० स, ज, स, स ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'हरिणीप्लुता',
      title_eng: 'Hariṇīplutā',
      id: 31,
      definition_sans: '<p>प्रथमाक्षरमाद्यतृतीययो-<br>र्द्रुतविलंबितकस्त च पादयोः ।<br> यदि चेन्न तदा कमलेक्षणे<br>भवति सुंदरि सा हरिणीप्लुता ॥</p><p>यदि द्रुतविलंबितकस्य छंदसः आद्यतृतीययोः पादयोः प्रथमाक्षरं चेत् एकादशाक्षरमेवं विषमपादयोः तदेयं हरिणीप्लुता । कमलवदीक्षणे यस्याः सा तत्संबुद्धौ हेसुंदरि शुभांगे । हरिणीप्लुता । च० १, ३; अ० ११, ग० स, स; स; ल, ग । च० २, ४; अ० १२, ग० न, भ, भ, र ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'वंशस्थम् ',
      title_eng: 'Vamśastham',
      id: 32,
      definition_sans: '<p>उपेंद्रवज्रा चरणेषु संति चेत्<br>उपांत्यवर्णा लघवः कृता यदा ।<br>मदोल्लसद्भ्रूजितकामकार्मुके<br>वदंति वंशस्थमिदं बुधास्तदा ॥</p><p>यदा उपेंद्रवज्राचरणेषु उपांत्यवर्णाः अंत्यसमीपस्था वर्णा एकादशसंज्ञका लघवः संति प्रतिचरणे एकादशो वर्णो लघुस्तदा वंशस्थम् । मदेन उल्लसंतौ भ्रुवौ ताभ्यां जितं कामकार्मुकं मदनधनुर्यया सा तत्संबुद्धौ । अंत्यस्य समीपमुपांत्यम् । उपांत्ये भवा उपांत्याः । उपांत्याश्च ते वर्णाश्चेति । वंशस्थम् । च०अ० १२, ग० ज त, ज, र; यतिः ५, ७॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'इंद्रवंशा',
      title_eng: 'Indravamśā',
      id: 33,
      definition_sans: '<p>यस्यामशोकांकुरपाणिपल्लवे<br>वंशस्थपादा गुरूपूर्ववर्णकाः ।<br>तारूण्यहेलारतिरंगलालसे<br>तामिंद्रवंशां कवयः प्रचक्षते ॥</p><p>यस्यामशोकेति ॥ हे तारूण्यहेलारतिरंगलालसे कवयो यस्यां वंशास्थपादा गुरूपूर्ववर्णका भवंति । हे अशोकांकुरपाणिपल्लवे  तामिंद्र्वंशां प्रचक्षते ब्रुवते । अशोकांकुरवत्पाणिपल्लवौ यस्याः सा । तारूण्यस्य हेलास्ताभी रतिरंगे लालसा अभिलाषो यस्याः सा तत्संबुद्धौ ।  इंद्रवंशा । च०अ० १२, ग० त, त, ज, र; यतिः ॥ ५,७॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'प्रभावती',
      title_eng: 'Prabhāvatī',
      id: 34,
      definition_sans: '<p>यस्यां प्रिये प्रथमकमक्षरद्वयं<br>तुर्यं तथा गुरू नवमं दशांतिकम् ।<br>सांत्यं भवेद्यति विरतिर्युगग्रहैः<br>सा लक्षिता ह्यमृतलते प्रभावती ॥</p><p>यस्यां प्रथममक्षरद्वयं तुर्यं तथा चतुर्थं तथा नवमं दशांतिकं दशसहितं त्रयोदशं वर्णं चतुर्भिर्नवभिश्चाक्षरैर्विरतिः सा प्रभावती लक्षिता कथिता । अमृतस्य लतेव लता या सा तत्संबुद्धौ ॥प्रभावती । च०अ० १३, ग० ज, भ, स, ज, ग; यतिः ४, ९ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'प्रहर्षिणी',
      title_eng: 'Praharṣiṇī',
      id: 35,
      definition_sans: '<p>आद्यं चेत्त्रितयमथाष्टमं नवांत्यं<br>द्वे चांत्ये गुरूविरतौ सुभाषिते स्यात् ।<br>विश्रामो भवति महेशनेत्रदिग्भि-<br>र्विज्ञेया ननु सुभगे प्रहर्षिणी सा ॥</p><p>प्रथमतः वर्णत्रयं अथाऽष्टमं नवांत्यं दशमं चांत्ये द्वे द्वादशत्रयोदशाख्ये एते गुरवो भवंति । वर्णत्रयानंतरं दशवर्णानंतरं च विश्रामः स्यात् सा प्रहर्षिणी विज्ञेया ज्ञातव्या । सुशोभनं भाषणं यस्याः सा । सुशोभना दंता यस्याः सा सुदती तत्संबुद्धौ । प्रहर्षिणी । च०अ० १३, ग० म, न, ज, र; ग; यतिः ३, १०॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'वसंततिलका',
      title_eng: 'Vasantatilakā',
      id: 36,
      definition_sans: '<p>आद्यं द्वितीयमपि चेद्गुरु तच्चतुर्थं<br>यत्राष्टमं च दशमांत्यमुपांत्यमंत्यम् ।<br>कामांकुशांकुशितकामिमतंगजेंद्रे<br>कांते वसंततिलकां किल तां वदंति ॥</p><p>यत्र आद्यं प्रथमं द्वितीयमपि गुरू चतुर्थं दशमांत्यं एकादशमुपांत्यं त्रयोदशं अंत्यं चतुर्दशं एते गुरवः स्युः हे कांते बुधास्तां वसंततिलकां वदंति । काम एवांकुशस्तेनांकुशिता वशीकृताः  कामिन एव मनंगजेंद्रा यया सा तत्संबुद्धौ । वसंततिलका । च०अ० १४, ग० त, भ, ज, ज; ग, ग ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'मालिनी',
      title_eng: 'Mālinī',
      id: 37,
      definition_sans: '<p>प्रथममगुरूषट्कं विद्यते यत्र कांते<br>तदनु च दशमं चेदक्षरं द्वादशांत्यम् ।<br>गिरिभिरथ तुरंगैर्यत्र कांते विरामः<br>सुकविजनमनोज्ञा मालिनी सा प्रसिद्धा ॥</p><p>यत्र प्रथमं षट्कमगुरू लघ्वेव भवति तदनु दशमं द्वादशांत्यं त्रयोदशं च लघु । अष्टभिः सप्तभिश्च विरामस्तदा सुकविजनमनोज्ञा मालिनी सा प्रसिद्धा कृता । मालिनी । च०अ० १५, ग० न,न, म, य, य; यतिः ८, ७॥ </p>',
      definition_eng: ''
    },
    {
      title_sans: 'हरिणी',
      title_eng: 'Hariṇī',
      id: 38,
      definition_sans: '<p>सुमुखि लघवः पंच प्राच्यास्ततो दशमांतिकं<br>तदनु ललितालापे वर्णौ यदि त्रिचतुर्दशौ ।<br>प्रभवति पुनर्यत्रोपांत्यः स्फुरत्करकंकणे <br>यतिरपि रसैर्वेदैरश्वैः स्मृता हरिणीति सा ॥</p><p>यत्र प्रथमाः पंचवर्णा लघवः संति । ततो दशमांतिक एकादशः यदि त्रिचतुर्दशौ त्रयोदशचतुर्दशौ लघू स्यातां उपांत्यः षोडशोऽपि लघुः । षड्भिः चतुर्भिः सप्तभिश्च विरामः स्यात्तदा सा हरिणी स्मृता । स्फुरंति करयोः कंकणानि यस्याः सा । ललित आलापो यस्याः सा । च०अ० १७, ग० न, स, म, र, स; ल, ग; यतिः ६, ४,७ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'शिखरिणी',
      title_eng: 'śikhariṇī',
      id: 39,
      definition_sans: '<p>यदा पूर्वो ह्रस्वः कमलनयने षष्ठकपरा-<br>स्ततो वर्णाः पंच प्रकृतिसुकुमारांगि लघवः ।<br>त्रयोऽन्ये चोपांत्याः सुतनुजघनाभोगसुभगे<br>रसै रूद्रैर्यस्यां भवति विरतिः सा शिखरिणी ॥</p><p>हे सुतनुजघनाभोगसुभगे यदा पूर्वो वर्णो ह्रस्वो भवति । हे प्रकृतिसुकुमारांगि ततः षष्ठतः पंच वर्णाः सप्तमाष्टमनवमदशमैकादशा लघवः संति । अन्ये उपांत्यास्त्रयो वर्णाश्चतुर्दशपंचदशषोडशा लघवो भवंति । यस्यां षड्भी एकादशैर्विरतिर्भवेत् । हे सुतनु सा शिखरिणी कथिता । कमलवन्नयने यस्याः सा । प्रकृत्य स्वभावेन सुकुमाराण्यंगानि यस्याः । जघनयोराभोगस्तेन सुभगा । सुशोभना तनुर्यस्याः सा तत्संबुद्धौ । च०अ० १७, ग० य, म, न, स, भ; ल, ग; यतिः ६, ११॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'पृथ्वी',
      title_eng: 'Pṛthvī',
      id: 40,
      definition_sans: '<p>द्वितीयमलिकुंतले यदि षडष्टमं द्वादशं<br>चतुर्दशमथ प्रिये गुरू गभीरनाभिह्रदे ।<br>सपंचदशमंतिकं तदनु यत्र कांते यति-<br>र्गिरिंद्र्फणिभृत्कुलैर्भवति सुभ्रु पृथ्वी हि सा ॥</p><p>हे सुभ्रु यदि द्वितीयसम्ख्याकं गुरू स्यात् हे अलिकुंतले षष्ठमष्टमं च गुरू हे प्रिये द्वादशमथ चतुर्दशं गुरू हे गभीरनाभिह्रदे पंचदशेन सहितमंतिकं गुरू स्यात् । हे कांते यत्र अष्टभिः नवभिश्च यतिः स्यात्सा पृथ्वीनामकं वृत्तं भवति । अलिवभ्द्रमरवच्छ्यामाः कुंतला अलका यस्याः सा । गंभीरा निम्ना नाभिरेव ह्रदो यस्याः सा तत्संबुद्धौ । पृथ्वी च०अ० १७, ग०ज, स, ज, स, य; ल, ग; यतिः ८,९॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'मंदाक्रांता',
      title_eng: 'Mandākrānta ',
      id: 41,
      definition_sans: '<p>चत्वारः प्राक् सुतनु गुरवो द्वादशैकादशौ चे-<br>न्मुग्धे वर्णौ तदनु कुमुदामोदिनि द्वादशांत्यौ ।<br>तद्वच्चांत्यौ युगरसहयैर्यत्र कांते विरामो<br>मंदाक्रांतां प्रवरकवयस्तन्वि तां संगिरंते ॥</p><p>हेतन्वि प्रवरकवयो यत्र प्राक् चत्वारो वर्णा गुरवः स्युः हे कुमुदामोदिनि द्वादशैकादशौ गुरू स्तः हे मुग्धे त्रयोदशचतुर्दशौ गुरू स्यातां अंत्यौ षोडशसप्तदशौ तद्वद्गुरु युगरसहयैर्विरामः एतादृशीं तां मंदाक्रांतां संगिरंते । कुमुदवदामोदः सुगंधिर्यस्याः सा । मंदाक्रांता । च० अ० १७, ग० म, भ, न, त, त; ग, ग; यतिः ४, ६, ७॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'शार्दूलविक्रीडितम् ',
      title_eng: 'śārdūlavikrīḍitam',
      id: 42,
      definition_sans: '<p>आद्याश्चेद्गुरवस्त्रयः प्रियतमे षष्ठस्तथा चाष्टमो<br>नन्वेकादशतस्त्रयस्तदनु चेदष्टादशाद्यौ ततः ।<br>मार्तंडैर्मुनिभिश्च यत्र विरतिः पूर्णेंदुबिंबानने<br>तद्वृत्तं प्रवदंति काव्यरसिकाः शार्दूलविक्रीडितम् ॥</p><p>हे पूर्णेंदुबिंबानने काव्यरसिकास्तद्वृत्तं शार्दूलविक्रीडितं वदंति । यत्राद्यास्त्रयो गुरवः षष्ठस्तथाऽष्टमः गुरूः । ननु एकादशतस्त्रयः द्वादशत्रयोदशचतुर्दशा गुरवः ततश्चेदष्टादशस्याद्यौ षोडशसप्तदशौ गुरू स्याताम् । यत्र द्वादशसप्तभिर्विरतिः हे प्रियतमे तदेतच्छार्दूलविक्रीडितं । पूर्णश्चासाविंदुस्तस्य बिंबवदाननं यस्याः सा अतिशयेन प्रिया प्रियतमा तस्याः संबुद्धौ । शार्दूलविक्रीडितम् । अ०अ० १९, ग० म, स, ज, स, त, त; ग, यतिः १२, ७ ॥</p>',
      definition_eng: ''
    },
    {
      title_sans: 'स्रग्धरा ',
      title_eng: 'Sragdharā',
      id: 43,
      definition_sans: '<p>चत्वारो यत्र वर्णाः प्रथममलघवः षष्ठकः सप्तमोऽपि<br>द्वौ  तद्वत्षोडशाद्यौ मृगमदमुदिते षोडशांत्यौतथात्यौ ।<br> रंभास्तंभोरुकांते मुनिमुनिमुनिभिर्द्दश्यते चेद्विरामो बाले<br> वंद्यैः कवींद्रैः सुतनु निगदिता स्रग्धरा सा प्रसिद्धा ॥</p><p>हे सुदति वंद्यैः पूज्यैः कवींद्रैः प्रसिद्धा इयं स्रग्धरा गदिता । यत्र प्रथमं चत्वारो वर्णा गुरवः संति षष्ठकः सप्तमोऽपि तद्वद्गुरुः । षोडशाद्यौ चतुर्दशपंचदशौ तथांत्यौ सप्तदशाष्टादशौ गुरू स्याताम् । मुनिमुनिमुनिभिर्विरामः । हे रंभास्तंभोरुकांते हे बाले इयं स्रग्धरा प्रसिद्धा मृगस्य मदेन मुदिता सा । रंभायाः स्तंभवदूर्वोः कांतिर्यस्याः सा । सुशोभना दंता यस्याः सा तत्संबुद्धौ । च० अ० २१, ग० म, र, भ, न, य, य, य; यतिः ७, ७, ७॥ </p>',
      definition_eng: ''
    }
  ],
  exercises: [
    {
      id: '1',
      title: 'Level 1 - लघु & गुरु',
      question: 'Identify the short syllable:',
      options: ['क', 'क्ष', 'त्र', 'अः'],
      ans: 'क'
    },
    {
      id: '2',
      title: 'Level 1 - लघु & गुरु',
      question: 'Pick the odd one out:',
      options: ['टम्', 'क्ष', 'ज्ञ', 'र'],
      ans: 'र'
    },
    {
      id: '3',
      title: 'Level 2 - गणाः',
      question: 'Number of syllabic instants in one Gaṇa of Mātrā Chandas',
      options: ['1', '4', '2', '8'],
      ans: '4'
    },
    {
      id: '4',
      title: 'Level 2 - गणाः',
      question: 'Which  Gaṇa in Varṇa chandas contains all short syllables?',
      options: ['मगण', 'ल', 'नगण', 'जगण'],
      ans: 'नगण'
    },
    {
      id: '5',
      title: 'Level 3 - Identify the metre',
      question: 'This metre which contains 11 syllables in each quarter has long syllables in its 1st, 2nd, 4th, 5th, 8th, 10th and 11th syllables of each quarter.',
      options: ['Indravajrā', 'Upendravajrā', 'Pankti', 'Candravartma'],
      ans: 'Indravajrā'
    },
    {
      id: '6',
      title: 'Level 3 - Identify the metre',
      question: 'The metre which contains 30 syllables in each quarter is:',
      options: ['Anuṣṭup', 'Āryā ', 'kṣamā', 'Rucirā'],
      ans: 'Āryā '
    },
    {
      id: '7',
      title: 'Level 3 - Identify the meter:',
      question: '<br>सौम्यां दृष्टि देहि स्नेहा हे हेऽस्माकं मानं मुक्त्वा<br>शशधरमुखिमुखमपनय मम हृदि मनसिजरुजमपहर लघुतरमिह॥',
      options: ['अनङ्गक्रीडावृत्तम्', 'रुचिरावृत्तम्', 'शिखावृत्तम्', 'वैतालीयछन्दस्'],
      ans: 'अनङ्गक्रीडावृत्तम्'
    },
    {
      id: '8',
      title: 'Level 4 - Identify',
      question: 'How many short and long syllables are there in the following verse?<br>रघुकुलनलिनविकसनशशभृति दशमुखरिपुकुलतिमिर हरे।<br>विषधरविषमविषयविषहरमहसि कुरु रतिमिह दशरथतनये॥',
      options: ['27 long syllables and one short syllable', '27 short syllables and one long syllable', '14 long and 14 short syllables', '20 short and 8 long syllables'],
      ans: '27 short syllables and one long syllable'
    },
    {
      id: '9',
      title: 'Level 4 - Identify the meter:',
      question: 'A mixed variety of several varieties of Mātrāsamaka metre gives rise to :',
      options: ['śikhāvṛttam', 'khañjāvṛttam', 'Pādākulaka', 'bhadravirāṭ'],
      ans: 'Pādākulaka'
    },
    {
      id: '10',
      title: 'Level 5 - Identify the meter:',
      question: 'Verses in which all the quarters are dissimilar from the point of view of number and placement of syllables, are called :',
      options: ['mātrāsamavṛtta', 'Ardhasamavṛtta', 'khañjāvṛtta', 'Viṣamavṛtta'],
      ans: 'Viṣamavṛtta'
    }
  ]
})

export const mutations = {
  toggleSidebar (state) {
    state.sidebar = !state.sidebar
  }
}
